src/cf/InformationRegisters/МП_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МП_НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МП_ТипыНастроекПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/МП_ИзмененныеНастройкиСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МП_ИзмененныеНастройкиСинхронизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНастроекОбменаСМобильнымКлиентом</v8:Type>
						<v8:Type>cfg:EnumRef.МП_ТипыНастроекПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/МП_ТипыНастроекПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МП_ТипыНастроекПользователей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьPushУведомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальныйРазмерВложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальныйРазмерФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграничениеФорматовПередаваемыхФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодПервичнойЗагрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодробныйПротоколОбменаСМобильнымУстройством</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияКалендаря</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияКонтроля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияМероприятий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияОтсутствий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияСамочувствий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияУчетаВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокУстареванияДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФорматыПередаваемыхФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРаботПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпособУказанияВремени</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/МП_НастройкиПользователей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Записывает персональную настройку синхронизации с мобильными клиентами
// Параметры:
//	Пользователь - ссылка на пользователя
//	ТипНастройки - ссылка на перечисление МП_ТипыНастроекПользователей
//	Значение - значение настройки
Процедура ЗаписатьНастройку(Пользователь, ТипНастройки, Значение) Экспорт

	МенеджерЗаписи = СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Настройка    = ТипНастройки;
	МенеджерЗаписи.Значение     = Значение;

	МенеджерЗаписи.Записать();

КонецПроцедуры

// Возвращает персональную настройку синхронизации с мобильными клиентами.
// Если настройка ранее не выполнялась, то возвращается значение по умолчанию.
// Параметры:
//	Пользователь - ссылка на пользователя
//	ТипНастройки - ссылка на перечисление МП_ТипыНастроекПользователей
Функция ПолучитьНастройку(Пользователь, ТипНастройки) Экспорт

	МенеджерЗаписи = СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Настройка = ТипНастройки;
	МенеджерЗаписи.Прочитать();

	Если МенеджерЗаписи.Значение = Неопределено
		Или Не МенеджерЗаписи.Выбран() Тогда

		МенеджерЗаписи.Пользователь = Пользователь;
		МенеджерЗаписи.Настройка = ТипНастройки;

		Если ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.МаксимальныйРазмерФайлов Тогда
			МенеджерЗаписи.Значение = 512;

		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.ПериодПервичнойЗагрузки Тогда
			МенеджерЗаписи.Значение = 7;

		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.СинхронизацияЗадач Тогда
			МенеджерЗаписи.Значение = Истина;

		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.СинхронизацияКалендаря Тогда
			МенеджерЗаписи.Значение = Истина;

		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.СинхронизацияПочты Тогда
			МенеджерЗаписи.Значение = Истина;

		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.СинхронизацияКонтроля Тогда
			МенеджерЗаписи.Значение = Истина;

		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.СинхронизацияОтсутствий Тогда
			
			МенеджерЗаписи.Значение = ПолучитьФункциональнуюОпцию("ИспользоватьОтсутствия");
			
			РегистрыСведений.МП_ИзмененныеНастройкиСинхронизации.ДобавитьЗапись(
					Пользователь, Перечисления.МП_ТипыНастроекПользователей.СинхронизацияОтсутствий);
					
		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.СинхронизацияСамочувствий Тогда
			
			МенеджерЗаписи.Значение = ПолучитьФункциональнуюОпцию("УчетСамочувствияСотрудников");
			
			РегистрыСведений.МП_ИзмененныеНастройкиСинхронизации.ДобавитьЗапись(
				Пользователь, Перечисления.МП_ТипыНастроекПользователей.СинхронизацияСамочувствий);
			
		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.СрокУстареванияДанных Тогда
			МенеджерЗаписи.Значение = 30;

		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.ОграничениеФорматовПередаваемыхФайлов Тогда
			МенеджерЗаписи.Значение = Ложь;

		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.ФорматыПередаваемыхФайлов Тогда
			МенеджерЗаписи.Значение = 
				МП_СлужебныйПовтИсп.СписокФорматовФайловПоУмолчанию();

		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.ПодробныйПротоколОбменаСМобильнымУстройством Тогда
			МенеджерЗаписи.Значение = Ложь;

		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.СинхронизацияМероприятий Тогда
			
			МенеджерЗаписи.Значение = ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеМероприятиями");
			
			РегистрыСведений.МП_ИзмененныеНастройкиСинхронизации.ДобавитьЗапись(
				Пользователь, Перечисления.МП_ТипыНастроекПользователей.СинхронизацияМероприятий);
				
		ИначеЕсли ТипНастройки = 
			Перечисления.МП_ТипыНастроекПользователей.СинхронизацияУчетаВремени Тогда
			
			МенеджерЗаписи.Значение = ПолучитьФункциональнуюОпцию("ВестиУчетФактическихТрудозатрат");
			
			РегистрыСведений.МП_ИзмененныеНастройкиСинхронизации.ДобавитьЗапись(
				Пользователь, Перечисления.МП_ТипыНастроекПользователей.СинхронизацияУчетаВремени);
				
		КонецЕсли;

		МенеджерЗаписи.Записать();

	КонецЕсли;

	Возврат МенеджерЗаписи.Значение;

КонецФункции

Функция ДатаУстаревания(Пользователь) Экспорт
	
	СрокУстареванияДанных = ПолучитьНастройку(Пользователь, 
		Перечисления.МП_ТипыНастроекПользователей.СрокУстареванияДанных);
	
	ДатаУстареванияДанных = НачалоДня(ТекущаяДатаСеанса() - (СрокУстареванияДанных * 86400));

	Возврат ДатаУстареванияДанных; 
	
КонецФункции

#КонецЕсли
